Repository: pepr/progit2-cs
Catalog: omegat/ScottChacon_ProGit2-omegat.tmx
Source language: en
Languages: cs

source: Git doesn't think of or store its data this way.
cs: Git o ukládání dat tímto způsobem neuvažuje.

source: Git doesn’t have a modify-history tool, but you can use the rebase tool to rebase a series of commits onto the HEAD they were originally based on instead of moving them to another one.
cs: Git nemá zvláštní nástroj k úpravě historie, ale můžete využít nástroje přeskládání, jímž přeskládáte sérii revizí na revizi HEAD, na níž se původně zakládaly. Revize není třeba přesouvat jinam.

source: Git figured out that about 12 commits came between the commit you marked as the last good commit (v1.0) and the current bad version, and it checked out the middle one for you.
cs: Git zjistil, že mezi revizí, kterou jste označili jako poslední dobrou (v1.0), a aktuální problémovou verzí je asi 12 revizí, a provedl checkout prostřední revize.

source: Git figures out that it's a rename implicitly, so it doesn't matter if you rename a file that way or with the `mv` command.
cs: Git umí zjistit, že jde o přejmenování, a proto nehraje roli, zda přejmenujete soubor tímto způsobem, nebo pomocí příkazu `mv`.

source: Git fires up the `send-pack` process, which initiates a connection over SSH to your server.
cs: Git spustí proces `send-pack`, který iniciuje spojení se serverem přes SSH.

source: Git has a few configuration options to help with these issues.
cs: Git disponuje několika konfiguračními parametry, které vám pomohou tyto problémy vyřešit.

source: Git has a number of different transfer protocols you can use.
cs: Git nabízí celou řadu různých přenosových protokolů.

source: Git has initialized the `objects` directory and created `pack` and `info` subdirectories in it, but there are no regular files.
cs: Git inicializoval adresář `objects` a vytvořil v něm podadresáře `pack` a `info`, nenajdeme tu však žádné skutečné soubory.

source: Git has made incredible progress on Windows, in the explosion of graphical user interfaces to it for all platforms, in IDE support and in business use.
cs: Git učinil neuvěřitelný pokrok ve spojení s Windows, ve vzniku grafických uživatelských rozhraní pro všechny platformy, v podpoře integrovaných vývojových prostředí (IDE) a v použitelnosti pro podnikání.

source: Git has three main states that your files can reside in: committed, modified, and staged.
cs: Git používá pro spravované soubory tři základní stavy: zapsáno (committed), změněno (modified) a připraveno k zapsání (staged).

source: Git hasn't automatically created a new merge commit.
cs: Git automaticky nevytvořil nový bod sloučení.

source: Git is a content-addressable filesystem.
cs: Git je obsahově adresovatelný systém souborů.

source: Git is a powerful tool, and allows you to do many things to and with your history, but every team and every project is different.
cs: Git je mocný nástroj a dovoluje vám s historií provádět mnoho věcí. Ale každý tým a každý projekt se liší.

source: Git operates slightly differently if you explicitly specify `file://` at the beginning of the URL.
cs: Pokud na začátek URL explicitně uvedete `file://`, pracuje Git trochu jinak.

source: Git provides a safer command to do this if you want to update a reference called `update-ref`:
cs: Git zná bezpečnější metodu, jak referenci aktualizovat: příkaz `update-ref`:

source: Git provides an easy way to check for this – before you commit, run `git diff --check`, which identifies possible whitespace errors and lists them for you.
cs: Git nabízí snadný způsob, jak tyto chyby zkontrolovat. Před zapsáním revize spusťte `git diff --check`, který zkontroluje prázdné znaky a zobrazí vám je.

source: Git stores and thinks about information much differently than these other systems, even though the user interface is fairly similar, and understanding those differences will help prevent you from becoming confused while using it.(((Subversion)))(((Perforce)))
cs: Ačkoli je uživatelské rozhraní velmi podobné jiným systémům, Git uvažuje o ukládaných informacích velmi odlišně. Pochopení těchto rozdílů vám pomůže předejít nejasnostem, které by mohly při používání Gitu vzniknout.(((Subversion)))(((Perforce)))

source: Git stores content in a manner similar to a UNIX filesystem, but a bit simplified.
cs: Git ukládá obsah podobným způsobem jako systém souborů UNIX, jen trochu jednodušeji.

source: Git tells you the original commit where you wrote those lines, even if it was in another file.
cs: Git vám vyhledá původní revizi, kde jste tyto řádky napsali, dokonce i když jsou v jiném souboru.

source: Git then creates a commit object that has the metadata and a pointer to the root project tree so it can re-create that snapshot when needed.(((git commands, commit)))
cs: Poté Git vytvoří objekt revize (commit) s metadaty a s ukazatelem na kořen stromu projektu, aby mohl v případě potřeby tento snímek obnovit.(((git příkazy, commit)))

source: Git thinks about its data more like a *stream of snapshots*.
cs: Git o svých datech uvažuje spíše jako o *sérii snímků*.

source: Git uses two main types of tags: lightweight and annotated.
cs: Git používá dva hlavní typy značek: prosté (lightweight) a anotované (annotated).

source: Git will also automatically remove commits that did not affect the subdirectory.
cs: Git také automaticky odstraní revize, které nemají na podadresář žádný vliv.

source: Git will ask you which files you would like to partially stage; then, for each section of the selected files, it will display hunks of the file diff and ask if you would like to stage them, one by one:
cs: Git se vás zeptá, které soubory chcete částečně připravit. Pro každou část vybraných souborů pak zobrazí komplexy (hunks) rozdílů diff daného souboru a u každého z nich se vás zeptá, jestli si ho přejete připravit k zapsání:

source: Git will detect these issues when you run a `git diff` command and try to color them so you can possibly fix them before you commit.
cs: Až spustíte příkaz `git diff`, Git se pokusí tyto problémy vyhledat a barevně označit, abyste je mohli případně ještě před zapsáním revize opravit.

source: Git will move them for the sake of efficiency into a file named `.git/packed-refs` that looks like this:
cs: Git je pro zvýšení účinnosti přesune do souboru `.git/packed-refs`, jenž má následující podobu:

source: Git will then record each snapshot appropriately:
cs: Git pak odpovídajícím způsobem nahraje všechny snímky:

source: Glob patterns are like simplified regular expressions that shells use.
cs: Masky souborů se podobají zjednodušeným regulárním výrazům, které znáte z shellu.

source: Grab the tree object:
cs: Načtěte objekt stromu:

source: Great.
cs: Výborně.

source: Having a good guideline for creating commits and sticking to it makes working with Git and collaborating with others a lot easier.
cs: Pokud stanovíte dobrá pravidla pro vytváření revizí (commit) a pokud se jich budete držet, bude práce s Gitem a spolupráce s ostatními mnohem jednodušší.

source: Having work themes isolated into topic branches also makes it easier for you to rebase your work if the tip of the main repository has moved in the meantime and your commits no longer apply cleanly.
cs: Izolováním tématických úkolů do tématických větví si také usnadníte přeskládání vaší práce v případě, kdy se vrchol v hlavním repozitáři mezi tím posunul a vaše revize se už nedají čistě aplikovat.

source: Here are a few commands that give you what Subversion used to.
cs: Na tomto místě proto uvedu pár příkazů, které jsou podobné jako v systému Subversion.

source: Here are all the objects in the example directory now, commented with what they store:
cs: Toto jsou všechny objekty v ukázkovém adresáři spolu s komentářem k tomu co obsahují:

source: Here is a method that gives you an associative array where the key is the user name and the value is an array of paths to which the user has write access:
cs: Používá se tu metoda asociativních polí, kdy klíč představuje jméno uživatele a hodnotu tvoří sada umístění, k nimž má uživatel oprávnění pro zápis:

source: Here is a small Ruby script that does that:
cs: Tady je malý Ruby skript, který to umí:

source: Here is an example of adding your server as a remote:
cs: Tady je příklad, jak můžete váš server přidat jako vzdálený:

source: Here is an example pre-rebase script that checks for that.
cs: Jako příklad uvedeme skript pre-rebase, který bude toto pravidlo kontrolovat.

source: Here is another example .gitignore file:
cs: Další příklad souboru `.gitignore`:

source: Here we can see the two commits that we have had checked out, however there is not much information here.
cs: Vidíme tu obě revize, jichž jsme se zbavili, ale není tu k nim mnoho informací.

source: Here we'll discuss what they are and in what basic circumstances you would want (or not want) to use them.
cs: V této části si probereme, co jsou zač a za jakých základních okolností je budete (nebo nebudete) chtít použít.

source: Here you can do a number of things, including staging files, unstaging files, staging parts of files, adding untracked files, and seeing diffs of what has been staged.
cs: Tady můžete provádět celou řadu věcí, včetně přípravy souborů k zapsání, vracení připravených souborů, přípravy částí souborů, přidávání nesledovaných souborů a prohlížení změn v připravených souborech.

source: Here you can run `rev-parse` on your branch.
cs: Tehdy můžete na svou větev spustit příkaz `rev-parse`:

source: Here, we'll review a few basic tools for undoing changes that you've made.
cs: Proto se podíváme na pár základních nástrojů pro vracení změn, které jste udělali.

source: Here, we'll show you some of the most popular.
cs: Ukážeme si některé z nejpoužívanějších možností.

source: Here, you’ll look at a few interactive commands that can help you easily craft your commits to include only certain combinations and parts of files.
cs: V této části se podíváme na několik interaktivních příkazů, které vám mohou pomoci snadno určit, na jaké kombinace a části souborů má být omezena konkrétní revize.

source: Here’s an example to give you an idea of what it would take to get a SHA-1 collision.
cs: Abyste si udělali představu, jak je nepravděpodobné, že dojde ke kolizi hodnot SHA-1, připojujeme jeden malý příklad.

source: Here’s an example.
cs: Uveďme malý příklad.

source: How can you easily unmodify it – revert it back to what it looked like when you last committed (or initially cloned, or however you got it into your working directory)?
cs: Jak je můžete snadno zrušit a vrátit soubor zpět do podoby při posledním zápisu revize (nebo při prvním klonování nebo při jakékoliv činnosti, kterou jste soubor dostali do pracovního adresáře)?

source: How can you keep your code consistently up to date and your commits valid?
cs: Jak lze dosáhnout neustálé aktuálnosti vašeho kódu a platnosti vašich revizí?

source: How can you recover that commit at this point?
cs: Jak lze tedy v tuto chvíli ztracenou revizi obnovit?

source: How can you unstage one of the two?
cs: Jak lze tyto dva soubory vrátit z oblasti připravených změn?

source: How does Git do this?
cs: Jak to Git dělá?

source: How does Git know what branch you're currently on?
cs: Jak Git pozná, na jaké větvi se právě nacházíte?

source: How is that possible?
cs: Jak je tohle možné?

source: How much work are you contributing at a time?
cs: Kolik práce představuje jeden váš příspěvek?

source: How often do you contribute?
cs: A jak často přispíváte?

source: However, Git is pretty smart about figuring that out after the fact – we'll deal with detecting file movement a bit later.
cs: Nicméně, Git je dost chytrý na to, aby to zjistil. Detekcí přesunu souboru se budeme zabývat později.

source: However, anything you lose that was never committed is likely never to be seen again.
cs: Pokud však dojde ke ztrátě dat, která dosud nebyla součástí žádné revize, už je asi nikdy neuvidíte.

source: However, because no alternates are listed in this case, your object must be in a packfile.
cs: Protože však seznam v tomto případě neobsahuje žádné alternativní repozitáře, váš objekt musí být v balíčkovém souboru.

source: However, before you do that, note that if your working directory or staging area has uncommitted changes that conflict with the branch you're checking out, Git won't let you switch branches.
cs: Ale než tak učiníte, všimněte si, že pokud máte v pracovním adresáři nebo v oblasti připravených změn nezapsané změny, které kolidují s větví, do které se přepínáte, Git vám přepnutí větví nedovolí.

source: However, first you'll delete the `hotfix` branch, because you no longer need it – the `master` branch points at the same place.
cs: Nejprve však smažete větev `hotfix`, protože už ji nebudete potřebovat -- větev `master` ukazuje na totéž místo.

source: However, if someone at any point in the history of your project added a single huge file, every clone for all time will be forced to download that large file, even if it was removed from the project in the very next commit.
cs: Je jí fakt, že příkaz `git clone` stáhne vždy celou historii projektu, všechny verze všech souborů.

source: However, if someone uploaded a patch file generated via `format-patch` to a ticketing system or something similar, you can save the file locally and then pass that file saved on your disk to `git am` to apply it:
cs: Pokud však někdo nahrál soubor záplaty vygenerovaný příkazem `format-patch` do tiketového nebo podobného systému, můžete soubor uložit lokálně a poté na tento uložený soubor použít příkaz `git am`. Tímto způsobem záplatu aplikujete:

source: However, if there are too many loose objects (objects not in a packfile) or too many packfiles, Git launches a full-fledged `git gc` command.
cs: Pokud však identifikuje příliš mnoho volných objektů (objektů nezabalených do balíčkového souboru) nebo balíčkových souborů, spustí Git plnou verzi příkazu `git gc`.

source: However, if your message contains the proper pattern, Git allows you to commit:
cs: Pokud však zpráva obsahuje správný vzor, Git vám umožní revizi zapsat:

source: However, in order to do any collaboration in Git, you'll need to have a remote Git repository.
cs: Ale abyste mohli pomocí Gitu spolupracovat s ostatními, budete potřebovat vzdálený gitový repozitář.

source: However, it can be helpful sometimes when you need to see what’s really going on.
cs: Může se však hodit, až budete jednou potřebovat zjistit, co se doopravdy odehrává.

source: However, it can be very useful.
cs: Příkaz přesto může být velmi užitečný.

source: However, keep in mind that to collaborate with a couple of people on a private project, all you _need_ is an SSH server and a bare repository.
cs: To však nemění nic na tom, že ke spolupráci se skupinou lidí na soukromém projektu _vystačíte_ s jedním SSH serverem a holým repozitářem.

source: However, let's run `git status` one more time:
cs: Spusťme však ještě jednou příkaz `git status`:

source: However, maybe you want to run an external command, rather than a Git subcommand.
cs: Může se však stát, že budete chtít spustit externí příkaz, a ne dílčí příkaz Git.

source: However, that result is of limited use.
cs: Tento výsledek má však omezené použití.

source: However, the time-limiting options such as `--since` and `--until` are very useful.
cs: Naopak velmi užitečné jsou volby pro vymezení času, jako `--since` a `--until` („od“ a „do“).

source: However, there is a command called `git pull` which is essentially a `git fetch` immediately followed by a `git merge` in most cases.
cs: Ale máme tu příkaz zvaný `git pull`, což je ve většině případů v podstatě `git fetch` bezprostředně následovaný příkazem `git merge`.

source: However, there is another way: you can take the patch of the change that was introduced in `C4` and reapply it on top of `C3`.
cs: Existuje však ještě jiný způsob. Můžete vzít záplatu se změnou, která vznikla v revizi `C4`, a aplikovat ji na revizi `C3`.

source: However, this is equivalent to running something like this:
cs: Výsledek je však stejný, jako byste provedli následující:

source: However, this setup also has some serious downsides.
cs: Avšak i tato koncepce má závažné nedostatky.

source: However, you can set up other tracking branches if you wish – ones that track branches on other remotes, or don't track the `master` branch.
cs: Ale pokud si to přejete, můžete nastavit i jiné sledující větve -- takové, které budou sledovat větve v jiných vzdálených repozitářích, nebo které nebudou sledovat zrovna větev `master`.

source: However, you should be aware of how ridiculously unlikely this scenario is.
cs: Měli bychom však také říci, jak moc je nepravděpodobné, že taková situace nastane.

source: However, your reflog and a new set of refs that Git added when you did the `filter-branch` under `.git/refs/original` still do, so you have to remove them and then repack the database.
cs: Obsahuje ho však stále ještě reflog a v adresáři `.git/refs/original` také nová sada referencí, které Git přidal při spuštění příkazu `filter-branch`. Budete je proto muset odstranit a databázi znovu zabalit.

source: I didn't much like that I was writing what I felt was essentially a community resource and also talking about my company in it.
cs: Nesedělo mi, že píši o něčem, co bylo v podstatě komunitním prostředkem, a přitom jsem současně psal o roli své firmy.

source: I had been a developer for several years by then, but this was the right turn that sent me down a much more interesting path than the one I was on.
cs: V té době už jsem několik let pracoval jako vývojář, ale tohle byl bod zvratu, který mě nasměroval na mnohem zajímavější cestu, než po které jsem šel před tím.

source: I hope it helps you as much as it did me.
cs: Doufám, že vám pomůže stejně, jako pomohla mně.

source: I hope you enjoy this updated edition of Pro Git.
cs: Doufám, že se vám aktualizované vydání Pro Git bude líbit.

source: I wrote a small section in the original version of Pro Git about GitHub as an example of hosted Git which I was never very comfortable with.
cs: V původní verzi Pro Git jsem o GitHub napsal malou podkapitolu jako příklad hostování Gitu. Nikdy jsem z toho neměl dobrý pocit.

source: I'm happy that Pro Git has done so well and has also been able to be one of the few technical books on the market that is both quite successful and fully open source.
cs: Mám radost z toho, že si kniha Pro Git vedla tak dobře a že se jako jedna z mála technických publikací na trhu stala poměrně úspěšnou a plně Open Source.

source: If Git cannot do it cleanly, it will not let you switch at all.
cs: Pokud by se to Gitu nemělo podařit čistě, nedovolí vám přepnout vůbec.

source: If a particular version of a file is in the Git directory, it's considered committed.
cs: Nachází-li se konkrétní verze souboru v adresáři Gitu, je soubor ve stavu „zapsaný“.

source: If a user SSHs into a server and has write access to the `/opt/git/my_project.git` directory, they will also automatically have push access.
cs: Pokud se uživatel dostane přes SSH na server a má oprávnění k zápisu do adresáře `/opt/git/my_project.git`, má automaticky také oprávnění k odesílání dat.

source: If all your commit messages look like this, things will be a lot easier for you and the developers you work with.
cs: Pokud budou všechny vaše zprávy k revizím vypadat takto, usnadníte tím práci sobě i svým spolupracovníkům.

source: If anyone wants to verify a tag, they can directly import your PGP key by pulling the blob directly out of the database and importing it into GPG:
cs: Bude-li chtít značku kdokoli ověřit, může přímo importovat váš klíč PGP tak, že stáhne blob z databáze a naimportuje ho do programu GPG:

source: If it does, then it was introduced sometime before this middle commit; if it doesn’t, then the problem was introduced sometime after the middle commit.
cs: Pokud ano, vznikla chyba někdy před touto prostřední revizí; pokud ne, pak je problém záležitostí revizí zapsaných až po této prostřední revizi.

source: If it has been modified and was added to the staging area, it is staged.
cs: Pokud byl soubor upraven a přidán do oblasti připravených změn, je ve stavu „připraven k zapsání“.

source: If not configured, Git uses your system's default editor, which is system dependant.
cs: Pokud jej nenastavíte, použije Git výchozí editor nastavený v systému, což závisí na systému.

source: If our environment looks like this:
cs: Dejme tomu, že situace vypadá následovně:

source: If she merges `origin/master`, that is the single commit that will modify her local work.
cs: Pokud začlení `origin/master`, bude to jediná revize, která změní její lokální práci.

source: If some of the changes modify the same file, try to use `git add --patch` to partially stage files (covered in detail in <<_interactive_staging>>).
cs: Pokud některé změny upravují stejný soubor, zkuste použít příkaz `git add --patch` a připravit soubory k zapsání po částech (podrobnosti jsou popsány v kapitole <<_interactive_staging>>).

source: If someone else pushes a change to one file and then you push a change to another file, your `dcommit` will work fine:
cs: Jestliže někdo odešle na server změnu v jednom souboru a vy poté odešlete změnu provedenou v jiném souboru, příkaz `dcommit` bude proveden úspěšně:

source: If someone on your team force pushes changes that overwrite work that you've based work on, your challenge is to figure out what is yours and what they've rewritten.
cs: Pokud někdo ve vašem týmu vynutí odeslání změn, které přepíší práci z které vycházíte, pak potřebujete zjistit, co zůstalo vaše a co bylo přepsáno.

source: If someone opens that tarball, they get the latest snapshot of your project under a project directory.
cs: Až někdo tento tarball otevře, získá nejnovější snímek vašeho projektu v projektovém adresáři.

source: If that is different, you must set the `$user` variable manually.
cs: Pokud nejsou uživatelé stejní, budete muset ručně nastavit proměnnou `$user`.

source: If that server goes down for an hour, then during that hour nobody can collaborate at all or save versioned changes to anything they're working on.
cs: Pokud takový server na hodinu vypadne, pak během této hodiny nelze spolupracovat vůbec, nebo přinejmenším není možné ukládat změny ve verzích souborů, na nichž uživatelé právě pracují.

source: If the QA team wants to push their `master` branch to `qa/master` on the remote server, they can run
cs: Chce-li QA tým odeslat větev `master` do adresáře `qa/master` na vzdáleném serveru, může použít příkaz:

source: If the `git status` command is too vague for you – you want to know exactly what you changed, not just which files were changed – you can use the `git diff` command.(((git commands, diff))) We'll cover `git diff` in more detail later, but you'll probably use it most often to answer these two questions: What have you changed but not yet staged?
cs: Pokud je pro vás příkaz `git status` příliš neurčitý -- chcete přesně vědět, co jste změnili, nejen jaké soubory jste změnili --, můžete použít příkaz `git diff`.(((git příkazy, diff))) Podrobněji se budeme příkazu `git diff` věnovat později, ale nejčastěji ho budete využívat k zodpovězení těchto dvou otázek: Co jste změnili, ale ještě nepřipravili k zapsání?

source: If the apply tries to modify a file that you’ve since modified, you’ll get a merge conflict and will have to try to resolve it.
cs: Pokud se příkaz apply pokusí změnit soubor, který jste mezitím ručně změnili jinak, dojde ke konfliktu při slučování, který budete muset vyřešit.

source: If the branch name you're trying to checkout (a) doesn't exist and (b) exactly matches a name on only one remote, Git will create a tracking branch for you:
cs: Pokud jméno větve, na kterou se chcete přepnout (checkout) (a) dosud neexistuje a (b) přesně odpovídá jménu v jediném vzdáleném repozitáři, vytvoří Git sledující větev za vás:
